app/views/products/index.html.erb

<script type="text/javascript" charset="utf-8">
$(function() {
  $(".js-more").on("click", function() {
    var id = $(this).data("id");
    $.get("/products/" + id + ".json", function(data) {
        var inventoryText = "<strong>Available</strong>";
        if(data["inventory"] == "0"){
          inventoryText = "<strong>Sold Out</strong>";
        }
        var descriptionText = "<p>" + data["description"] + "</p><p>" + inventoryText + "</p>";
        $("#product-" + id).html(descriptionText);

        var ordersText = ""
        data["ordered_products"].forEach(order => {
          ordersText += "<ul><li> Order ID: " + order["id"] + "</li>"
          ordersText += "<li> Created at: " + order["created_at"] + "</li></ul>"
        })
        $("#product-" + id + "-orders").html(ordersText)
    });
  });
});
---
SELECT "products".* FROM "products"